// --створити масив з:
// - з 5 числових значень
// - з 5 стрічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//
// let num = [1, 3 , 5, 2, 6];
// let str = ['Alex', 'man', 'woman', 's', 'b'];
// let mix = [1, 2, 4, 'Alex', 'man', true, false];
// console.log(num, str, mix);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let array = [];
// array[0] = 2;
// array[5] = 'Hello';
// array[3] = '3';
// console.log(array)

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 0; i < 10; i++){
//     document.write('<div>Hello world!</div>')
}
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// for (let i = 0; i < 10; i++){
//     // document.write('<div>Hello world! '+ i +' </div>');
//     document.write(`<div>Hello ${i} world!</div>`);
// }


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let i = 0;
// while(i < 20){
//     document.write('<h1>Hello ' + i + ' world!</h1>');
//     i++
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let a1 = [1, 45, 67, 46, 67, 4589, 29, 5784, 586];
// for (let i = 0; i < a1.length; i++) {
//     console.log(a1[i]);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let a1 = ['qwer', '45', 'dkgj', 'vfnj', '67', '4589', 'vg', 'bvfjg', 'fewoew', 'man'];
// for (let i = 0; i < a1.length; i++) {
//     console.log(a1[i]);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// let a1 = ['qwer', 45, 'dkgj', 'vfnj', 67, 4589, 'vg', 'bvfjg', 'fewoew', 'man'];
// for (let i = 0; i < a1.length; i++) {
//     console.log(a1[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let a1 = ['qwer', 45, 'dkgj', 'vfnj', 67, 4589, 'vg', 'bvfjg', 'fewoew', 'man', false, true];
// for (let i = 0; i < a1.length; i++) {
//     if (typeof a1[i] === 'boolean')
// {
//     console.log(a1[i]);
// }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// let a1 = ['qwer', 45, 'dkgj', 'vfnj', 67, 4589, 'vg', 'bvfjg', 'fewoew', 'man', false, true];
// for (let i = 0; i < a1.length; i++) {
//     if (typeof a1[i] === 'number')
// {
//     console.log(a1[i]);
// }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// let a1 = ['qwer', 45, 'dkgj', 'vfnj', 67, 4589, 'vg', 'bvfjg', 'fewoew', 'man', false, true];
// for (let i = 0; i < a1.length; i++) {
//     if (typeof a1[i] === 'string')
// {
//     console.log(a1[i]);
// }
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// let arr1 = [];
// arr1[0] = false;
// arr1[1] = 124;
// arr1[2] = true;
// arr1[3] = 'false';
// arr1[4] = 'Alex';
// arr1[5] = 4580;
// arr1[6] = 'Djem';
// arr1[7] = 'Hello';
// arr1[8] = 234;
// arr1[9] = 18;
// for(let item of arr1){
//     console.log(item);
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for(i=0; i<10; i++){
//     console.log(i);
//     document.write(i);
//     document.write('<br>');
// }
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for(i=0; i<100; i++){
//     console.log(i);
//     document.write(i);
//     document.write('<br>');
// }
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//
// for (i = 0; i < 200; i = i + 2) {
//     console.log(i);
//     document.write(i, '<br>');
// }
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// for (i = 0; i < 200; i++) {
//     if (i % 2 === 0) {
//         console.log(i);
//         document.write(i, '<br>');
//     }
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (i = 0; i < 200; i++) {
//     if (i % 2 !== 0) {
//         console.log(i);
//         document.write(i, '<br>');
//     }
// }

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)

// for (i = 0; i < 3; i++) {
//     for (j = 0; j < 60; j++) {
//         if (i > 1 && j >= 0) {
//             break
//         }
//         document.write(i + ' хвилин ' + j + ' секунд', '<br>');
//     }
// }

// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

// for (i = 0; i < 3; i++) {
//     for (j = 0; j < 60; j++) {
//         for (k = 0; k < 60; k++) {
//             if (i >= 2 && j >= 20 && k >= 0) {
//                 break
//             }
//             document.write(i + ' год ' + j + ' хв. ' + k + ' сек.');
//             document.write('<br>');
//         }
//     }
// }
//
//
//
// ______________________________________________________________________________________________________________________________________________________
//                                                                 РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________
//
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

// let arr2 = ['a', 'b', 'c'];
// for (i = 1; i < 4; i++) {
//     arr2.push(i);
// }
// console.log(arr2);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// let arr2 = [1, 2, 3];
// let newarr = [];
// for(i=arr2.length-1; i>=0; i--) {
//     newarr += arr2[i]
// }
// console.log(newarr);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// let arr2 = [1, 2, 3];
// for (i = 4; i < 7; i++) {
//     arr2.push(i);
// }
// console.log(arr2);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

// let arr2 = [1, 2, 3];
// for (i = 6; i >= 4; i--) {
//     arr2.unshift(i);
// }
// console.log(arr2);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

// let arr2 = ['js', 'css', 'jq'];
// let a = arr2.shift();
// console.log(a);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

// let arr2 = ['js', 'css', 'jq'];
// let a = arr2.pop();
// console.log(a);

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].

// let arr2 = [1, 2, 3, 4, 5];
// for (let i = 0; i < 3; i++) {
//     arr2.shift();
// }
// console.log(arr2);

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].

// let arr2 = [1, 2, 3, 4, 5];
// for (let i = 0; i < 3; i++) {
//     arr2.pop();
// }
// console.log(arr2);

// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//     Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри

// let arr2 = [1, 2, 3, 4, 5];
// let str = ['a', 'b', 'c'];
// let x = [];
// for (let i = 0; i < 2; i++) {
//     x[i] = arr2.pop();
// }
// for (let i = 0; i < 3; i++) {
//     arr2.push(str[i]);
// }
// for (let i = 1; i >= 0; i--) {
//     arr2.push(x[i]);
// }
// console.log(arr2);

// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.

// let arr2 = [1, 2, 3, 4, 5];
// let x = [];
// x.push(arr2.shift());
// x.push('a', 'b');
// for (let i = 0; i < 3; i++) {
//     x.push(arr2[i]);
// }
// x.push('c', arr2.pop(), 'e');
// console.log(x);

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

// Було


// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
//
// let arr2 = [1, 2, 3, 4, 5, 'a', 'b', 'c', 'd', 'e'];
// let x = [];
// for (let i = 0; i < arr2.length; i++) {
//     x.push(arr2[i]);
// }
// console.log(x);

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
// let arr2 = [1, 2, 3, 4, 5, 'a', 'b', 'c', 'd', 'e'];
// let x = [];
// for (let i = 0; i < arr2.length; i++) {
//     x[i] = (arr2[i]);
// }
// console.log(x);

//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while

// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i < arr.length) {
//     document.write(arr[i], `<br>`);
//     i++;
// }

// 2. перебрати його циклом for
//
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < arr.length; i++) {
//     document.write(arr[i], `<br>`);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 0;
// while (i < arr.length) {
//     if (i % 2 !== 0) {
//         document.write(arr[i], `<br>`);
//     }
//     i++;
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// аналогічно до попереднього, тільки з for

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 0;
// while (i < arr.length) {
//     if (arr[i] % 2 === 0) {
//         document.write(arr[i], `<br>`);
//     }
//     i++;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < arr.length; i++) {
//    if (arr[i] % 2 === 0) {
//        document.write(arr[i], `<br>`)
//    }
// }

// 7. замінити кожне число кратне 3 на слово "okten"

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'okten';
//     }
// }
// console.log(arr, `<br>`);

// 8. вивести масив в зворотньому порядку.

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.

// let x = [];
// for (let i = 0; i <= 100; i = i + 2) {
//     x[i] = i;
//     console.log(x[i]);
// }

// - заповнити його 50 непарними числами за допомоги циклу.
//
// let x = [];
// for (let i = 1; i <= 100; i = i + 2) {
//     x[i] = i;
//     console.log(x[i]);
// }

//
//
// 1. Створити пустий масив та :
//        a. заповнити його 50 парними числами за допомоги циклу.
//        b. заповнити його 50 непарними числами за допомоги циклу.
//        c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)

// let x = [];
// for (let i = 0; i < 20; i ++) {
//     x[i] = Math.random();
//     console.log(x[i]);
// }

//        d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)

// let x = [];
// for (let i = 0; i < 20; i ++) {
//     x[i] = Math.floor(Math.random() * (732-8)) + 8;
//     console.log(x[i]);
// }

//  2. Вивести за допомогою console.log кожен третій елемен

// let x = [];
// for (let i = 2; i < 20; i ++) {
//     x[i] = Math.floor(Math.random() * (732-8)) + 8;
//     console.log(x[i]);
// }
// for (let i = 0; i < 20; i=i+3) {
//     console.log(x[i]);
// }

//  3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.

// let x = [];
// for (let i = 2; i < 20; i++) {
//     x[i] = Math.floor(Math.random() * (732 - 8)) + 8;
//     console.log(x[i]);
// }
// for (let i = 0; i < 20; i = i + 3) {
//     if (x[i] % 2 === 0) {
//         console.log(x[i]);
//     }
// }

//  4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним
//  та записати їх в новий масив

// let x = [];
// let b = [];
// for (let i = 2; i < 20; i++) {
//     x[i] = Math.floor(Math.random() * (732 - 8)) + 8;
//     console.log(x[i]);
// }
// for (let i = 0; i < 20; i = i + 3) {
//     if (x[i] % 2 === 0) {
//         b.push(x[i]);
//     }
// }
//  console.log(b);


//  5. Вивести кожен елемент масиву, сусід справа якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

// let arr = [1, 2, 3, 5, 7, 9, 56, 8, 67];
// for (let i = 1; i < arr.length; i++) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i - 1])
//     }
// }

//  6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки.
//  Обрахувати середній чек.

// let arr = [100, 250, 50, 168, 120, 345, 188];
// let averCheck = 0;
// let sum = 0;
// for (let i = 0; i < arr.length; i++) {
//     sum = sum + arr[i]
// }
// console.log(averCheck = sum / arr.length);

//
//  7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

// let x = [];
// let y = [];
// for (let i = 0; i < 20; i++) {
//     x[i] = Math.random() * 5;
//     y.push(x[i]);
//     console.log(x[i]);
// }
// console.log(y)

//  8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому,
//  і якщо елемент є числом - додати його в інший масив.

// let x = ['qwer', '45', 'dkgj', 123, 356, 'vfnj', '67', 34, 78, '4589', 'vg', 'bvfjg', 'fewoew', 'man', 45, 673, 3646];
// let y = [];
// for (let i = 0; i < x.length; i++) {
//     if (typeof (x[i]) === 'number') {
//         y.push(x[i]);
//         }
// }
// console.log(y);

//
//
//
//
// ______________________________________________________________________________________________________________________________________________________
//                                                                     Додатково
// ______________________________________________________________________________________________________________________________________________________
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.

// let arr2 = ['a', 'b', 'c'];
// for (i = 1; i < arr2.length; i++) {
//     arr2[0] += arr2[i];
// }
// console.log(arr2[0]);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.

// let arr2 = ['a', 'b', 'c'];
// let i = 1;
// while(i < arr2.length){
//     arr2[0] += arr2[i];
//     i++;
// }
// console.log(arr2[0]);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.

// let arr2 = ['a', 'b', 'c'];
// let a = "";
// for (let item of arr2){
//     a += item;
// }
// console.log(a);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in зібрати всі букви в слово.

// let arr2 = ['a', 'b', 'c'];
// let a = "";
// for (let item in arr2){
//     a += arr2[item];
// }
// console.log(a);

// © 2021 GitHub, Inc.