// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let arr_num = [5, 4, 3, 2, 1]
// let arr_str = ['Alex', 'Mayya', 'Mila', 'Svitlana', 'Olexiy']
// let arr_bool = [true, false]
// let arr_mix = [arr_num + arr_str + arr_bool]
// console.log(arr_num)
// console.log(arr_mix)
//
// //
// // -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// //
// let arr2 = []
// arr2[4] = 5
// console.log(arr2)

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i = 0; i < 10; i++) {
//     document.write('<div> Hello </div>')
// }
//
// // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
//
// for (let i = 0; i < 10; i++){
//     document.write(`<div>Hello ${i} world!</div>`);
// }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let i = 0
// while (i<20) {
//     document.write('<h1> Ukraine is winning </h1>')
//     i++
// }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
//
// let i = 0
// while (i<20) {
//     document.write('<h1> ' + i + '  Ukraine is winning </h1>')
//     i++
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let arr10 = []
// for (let i = 0; i < 10; i++) {
//     arr10[i] = i
// }
// for (let i = 0; i < arr10.length; i++){
//     console.log(arr10[i])
// }
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let arr_mix = [5, 4, 3, 2, 1, 'Alex', 'Mayya', 'Mila', 'Svitlana', 'Olexiy', true, false]
// for (let i = 0; i < arr_mix.length; i++){
//     if (typeof arr_mix[i] === "boolean") {
//         console.log(arr_mix[i])
//     }
// }
// // - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// for (let i = 0; i < arr_mix.length; i++){
//     if (typeof arr_mix[i] === "number") {
//         console.log(arr_mix[i])
//     }
// }
// // - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// for (let i = 0; i < arr_mix.length; i++){
//     if (typeof arr_mix[i] === "string") {
//         console.log(arr_mix[i])
//     }
// }
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i<=100; i++){
//     console.log(i);
//     document.write(i, '<br>')
// }
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// ______________________________________________________________________________________________________________________________________________________
//                                                                 РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________
//
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let arr_abc = ['a', 'b', 'c']
// for (let i = 1; i<4; i++){
//     arr_abc.push(i)
// }
// console.log(arr_abc)
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// let arr_num = [1, 2, 3]
// let arr_new = []
// for (let i = arr_num.length-1; i >= 0; i--){
//     arr_new.push(arr_num[i])
// }
// console.log(arr_new)
// // - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// // - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
//
// for (let i = 6; i>=4; i--){
//     arr_num.unshift(i)
// }
// console.log(arr_num)

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
//
// let arr_five = [1, 2, 3, 4, 5]
// for (let i = 0; i<3; i++){
//     arr_five.shift()
// }
// console.log(arr_five)
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].

// let arr_five = [1, 2, 3, 4, 5]
// for (let i = 0; i<3; i++){
//     arr_five.pop()
// }
// console.log(arr_five)
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//     Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри


// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.
// let arr_mix = [1, 2, 3, 4, 5];
// let arr_x=[];
// for (let i = 0; i < 4; i++){
//     arr_x.unshift(arr_mix.pop());
// }
// arr_mix.push('a','b');
// for(let i = 0; i<arr_x.length-1; i++){
//     arr_mix.push(arr_x[i]);
// }
// arr_mix.push('c', arr_x.pop(), 'e');
// console.log(arr_mix);

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// let arr_train = [2,17,13,6,22,31,45,66,100,-18]

// 1. перебрати його циклом while
// let i = 0;
// while (i<arr_train.length){
//     console.log(arr_train[i]);
//     i++
// }

// 2. перебрати його циклом for
//
// for (x = 0; x<arr_train.length; x++){
//     console.log(arr_train[x])
// }
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let i = 0;
// while (i<arr_train.length){
//     if (i % 2 != 0){
//        console.log(arr_train[i]);
//     }
//     i++
// }
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (i = 0; i<arr_train.length; i++){
//     if (i % 2 != 0){
//        console.log(arr_train[i]);
//     }
// }
// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let i = 0;
// while (i<arr_train.length){
//     if (arr_train[i] % 2 === 0){
//        console.log(arr_train[i]);
//     }
//     i++
// }
// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for (i = 0; i<arr_train.length; i++){
//     if (arr_train[i] % 2 === 0){
//        console.log(arr_train[i]);
//     }
// }
// 7. замінити кожне число кратне 3 на слово "okten"
// for (i = 0; i<arr_train.length; i++){
//     if (arr_train[i] % 3 === 0){
//        arr_train[i] = 'okten';
//     }
// }
// console.log(arr_train)

// 8. вивести масив в зворотньому порядку.

// for (i = arr_train.length-1; i>=0; i--){
//        console.log(arr_train[i]);
// }
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1. Створити пустий масив та :
// let arr_random = [];
//        a. заповнити його 50 парними числами за допомоги циклу.
//        b. заповнити його 50 непарними числами за допомоги циклу.
//        c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// for (let i = 1; i<=20; i++){
//     arr_random[i] = Math.random();
// }
// console.log(arr_random)
//        d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)

// for (let i = 1; i<=20; i++){
//     arr_random[i] = Math.floor(Math.random()*(732-8) + 8);
// }
// console.log(arr_random)
//  2. Вивести за допомогою console.log кожен третій елемен
//  3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//  4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
//  5. Вивести кожен елемент масиву, сусід справа якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//
// let arr_even = [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ]
// for (let i = 0; i < arr_even.length-1; i++){
//     if (arr_even[i+1] % 2 === 0){
//         console.log(arr_even[i])
//     }
// }
//  6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// let arr_checks = [100,250,50,168,120,345,188];
// let avr_check = 0;
// for (check of arr_checks){
//     avr_check = check + avr_check;
// }
// console.log(avr_check / arr_checks.length)
//
//  7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//  8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
//
//
//
//
// ______________________________________________________________________________________________________________________________________________________
//                                                                     Додатково
// ______________________________________________________________________________________________________________________________________________________
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let arr_letters =  ['a', 'b', 'c'];
// let word = ''
// for(letter of arr_letters){
//     word = word + letter;
// }
// console.log(word)